#include<stdio.h>
#include<stdlib.h>
#include<pthread.h>
#include<unistd.h>
int ticket_sum = 10;
//使用特定的宏来初始化互斥锁
pthread_mutex_t myMutex = PTHREAD_MUTEX_INITIALIZER;
//使用初始化函数来初始化互斥锁 
//pthread_mutex_t myMutex;
//pthread_mutex_init(&myMutex , NULL);
//模拟售票员卖票
void *sell_ticket(void *arg) {
    //输出当前执行函数的线程 ID
    printf("当前线程ID：%lu\n", pthread_self());
    int i;
    int islock = 0;
    for (i = 0; i < 10; i++)
    {
        //当前线程“加锁”  使线程进入等待（阻塞）状态，直至互斥锁得到释放；
        islock = pthread_mutex_lock(&myMutex);
        //执行 pthread_mutex_trylock() 函数不会阻塞线程，直接返回非零数（表示加锁失败)
        //如果“加锁”成功，执行如下代码
        if (islock == 0) {
            //如果票数 >0 ,开始卖票
            if (ticket_sum > 0)
            {
                sleep(1);
                printf("%lu 卖第 %d 张票\n", pthread_self(), 10 - ticket_sum + 1);
                ticket_sum--;
            }
            //当前线程模拟完卖票过程，执行“解锁”操作
            pthread_mutex_unlock(&myMutex);
        }
    }
    return 0;
}

void *sell_ticket2(void *arg) {
    //输出当前执行函数的线程 ID
    printf("当前线程ID：%lu\n", pthread_self());
    int i;
    int islock = 1;
    for (i = 0; i < 10; i++)
    {
        //当前线程“加锁”  使线程进入等待（阻塞）状态，直至互斥锁得到释放；
        
        //执行 pthread_mutex_trylock() 函数不会阻塞线程，直接返回非零数（表示加锁失败)
        //如果“加锁”失败不阻塞重试，执行如下代码
        while(islock != 0){
            islock = pthread_mutex_trylock(&myMutex);
            if(islock == 0){
                //加锁成功
                //如果票数 >0 ,开始卖票
                if (ticket_sum > 0)
                {
                    sleep(1);
                    printf("%lu 卖第 %d 张票\n", pthread_self(), 10 - ticket_sum + 1);
                    ticket_sum--;
                }
                //当前线程模拟完卖票过程，执行“解锁”操作
                pthread_mutex_unlock(&myMutex);
                //修改锁记录
                islock = 1;
                //跳出循环加锁
                break;
            }else{
                printf("%lu 加锁失败，不阻塞，先去干别的事，缓一缓，继续重试\n", pthread_self());
                sleep(1);
            }
        }
    }
    return 0;
}

int main() {
    int flag;
    int i;
    void *ans;
    //创建 4 个线程，模拟 4 个售票员
    pthread_t tids[4];
    for (i = 0; i < 4; i++)
    {
        flag = pthread_create(&tids[i], NULL, &sell_ticket, NULL);
        if (flag != 0) {
            printf("线程创建失败!");
            return 0;
        }
    }
    sleep(10);   //等待 4 个线程执行完成
    for (i = 0; i < 4; i++)
    {
        //阻塞主线程，确认 4 个线程执行完成
        flag = pthread_join(tids[i], &ans);
        if (flag != 0) {
            printf("tid=%ld 等待失败！", tids[i]);
            return 0;
        }
    }

    /**
     * @brief sell_ticket
     * 
     * pthread_mutex_lock
     * 
     * 当前线程ID：140046173112064
        当前线程ID：140046164719360
        当前线程ID：140046156326656
        当前线程ID：140046147933952
        140046173112064 卖第 1 张票
        140046173112064 卖第 2 张票
        140046173112064 卖第 3 张票
        140046173112064 卖第 4 张票
        140046173112064 卖第 5 张票
        140046173112064 卖第 6 张票
        140046173112064 卖第 7 张票
        140046173112064 卖第 8 张票
        140046173112064 卖第 9 张票
        140046173112064 卖第 10 张票
     * 
     * 
     */

    /**
     * @brief  sell_ticket2  
     *  
     * pthread_mutex_trylock
     * 
     * 当前线程ID：140512865285888
        当前线程ID：140512856893184
        140512856893184 加锁失败，不阻塞，继续重试
        当前线程ID：140512840107776
        140512840107776 加锁失败，不阻塞，继续重试
        当前线程ID：140512848500480
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 1 张票
        140512856893184 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 2 张票
        140512856893184 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 3 张票
        140512856893184 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 4 张票
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 5 张票
        140512856893184 加锁失败，不阻塞，继续重试
        140512865285888 卖第 6 张票
        140512848500480 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512865285888 卖第 7 张票
        140512848500480 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512865285888 卖第 8 张票
        140512848500480 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512865285888 卖第 9 张票
        140512848500480 加锁失败，不阻塞，继续重试
        140512840107776 加锁失败，不阻塞，继续重试
        140512856893184 加锁失败，不阻塞，继续重试
        140512848500480 加锁失败，不阻塞，继续重试
        140512865285888 卖第 10 张票
     * 
     */
    return 0;
}